---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Azimuth
source: html/b70b6d11-7a42-0002-90f6-107ddca0e708.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Azimuth Property

The azimuth angle for this surface.

## Syntax (C#)
```csharp
public double Azimuth { get; }
```

## Remarks
The azimuth is computed as the angle of rotation between
 the outward normal of the surface and the Y-axis (clockwise is positive).